# GetCriticalPathSectionNumbers Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..GetCriticalPathSectionNumbers Method
MEPSystem Class See Also
---
Obtains a list of the critical path section numbers.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<int> GetCriticalPathSectionNumbers()
```

Visual Basic
---
```text
Public Function GetCriticalPathSectionNumbers As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetCriticalPathSectionNumbers()
```

# ### Return Value
The section numbers.
# Remarks
The section numbers are returned in order in the direction of flow.
# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace